# XMLSAXBeginDocMemory

## Description
Write XML using SAX, begin of a document in memory. XMLSAXEndDocMemory ends a document.

```pascal
FUNCTION XMLSAXBeginDocMemory(XMLHandle : LONGINT) : INTEGER;
```

```python

def vs.XMLSAXBeginDocMemory(XMLHandle):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|XMLHandle|LONGINT||

## Version
Availability: from Vectorworks 2011
## Category
* XML SAX